; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_7)
(:domain joint_bar)
(:objects
    link1 link2 link3 - link
    angle0 angle45 angle90 angle135 angle180 angle225 angle270 angle315 - angle)
(:init
    (AngleOrd angle0 angle45)
    (AngleOrd angle45 angle90)
    (AngleOrd angle90 angle135)
    (AngleOrd angle135 angle180)
    (AngleOrd angle180 angle225)
    (AngleOrd angle225 angle270)
    (AngleOrd angle270 angle315)
    (AngleOrd angle315 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)

    (HasAngle angle315 link1)
    (HasAngle angle270 link2)
    (HasAngle angle180 link3)
)
(:goal
(and
    (HasAngle angle0 link1)
    (HasAngle angle180 link2)
    (HasAngle angle90 link3)
    )
)
)

; plan
1. (increase_angle link1 angle315 angle0)
   deleted: (hasangle angle315 link1) (hasangle angle270 link2) (hasangle angle180 link3)
   added: (hasangle angle0 link1) (hasangle angle315 link2) (hasangle angle225 link3)
   goals met: 1 of 3
2. (decrease_angle link2 angle315 angle270)
   deleted: (hasangle angle315 link2) (hasangle angle225 link3)
   added: (hasangle angle270 link2) (hasangle angle180 link3)
   goals met: 1 of 3
3. (decrease_angle link2 angle270 angle225)
   deleted: (hasangle angle270 link2) (hasangle angle180 link3)
   added: (hasangle angle225 link2) (hasangle angle135 link3)
   goals met: 1 of 3
4. (decrease_angle link2 angle225 angle180)
   deleted: (hasangle angle225 link2) (hasangle angle135 link3)
   added: (hasangle angle180 link2) (hasangle angle90 link3)
   goals met: 3 of 3
